# These pacakges provide the necessary information for Homebrew 
# to install and manage various software packages and applications.
tap "homebrew/bundle"

# Homebrew can manage 3 kind of apps
# 'brew' will be used for CLI software
# 'mas' will be used for Mac App Store software
# 'cask' will be used for all the apps not available on the app store

# Essentials
brew "mas"
brew 'zsh-autosuggestions'
brew 'coreutils'
brew 'moreutils'


# Browsers
cask 'opera'
cask 'google-chrome'
cask 'orion'
cask 'tor'
cask 'brave-browser'

# Coding/Linux
cask 'visual-studio-code'
cask 'raspberry-pi-imager'
cask 'balenaetcher'
cask 'chatgpt'
brew 'python3'
brew 'ollama'
brew 'ansible'
# Remote
cask 'tailscale'
cask 'anydesk'

# App Store
mas "Bitwarden", id: 1352778147 
mas "Localsend", id: 1661733229 
mas "Dropover", id: 1355679052
mas "rCMD", id: 1596283165
mas "Apple Configurator", id: 1037126344
mas "Velja", id: 1607635845
mas "Enchanted LLM", id: 6474268307
mas "Microsoft Remote Desktop", id: 1295203466 

# Personal
cask 'sonos'
cask 'whatsapp'
cask 'spotify'

# Other
cask 'raycast'
cask 'alt-tab'
cask 'maccy'
cask 'shottr'
cask 'appcleaner'
cask 'latest'
cask 'applite'
cask 'disk-drill'
cask 'rocket'
cask 'qlstephen'
cask 'keka'
cask 'karabiner-elements'
cask 'keyclu'
cask 'chatgpt'